In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.ticker as ticker
import matplotlib.ticker as plticker
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [13]:
results = pd.read_csv('results.csv')

In [14]:
results.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [15]:
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43451 entries, 0 to 43450
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        43451 non-null  object
 1   home_team   43451 non-null  object
 2   away_team   43451 non-null  object
 3   home_score  43451 non-null  int64
 4   away_score  43451 non-null  int64
 5   tournament  43451 non-null  object
 6   city        43451 non-null  object
 7   country     43451 non-null  object
 8   neutral     43451 non-null  bool
dtypes: bool(1), int64(2), object(6)
memory usage: 2.7+ MB

In [16]:
results.shape

(43451, 9)

In [7]:
43451*9

391059

In [17]:
results.describe()

         home_score    away_score
count  43451.000000  43451.000000
mean       1.741640      1.181008
std        1.751591      1.397774
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000